DFTL_test1.txt
randwrite: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process

randwrite: (groupid=0, jobs=1): err= 0: pid=1172: Thu Jul 17 07:28:26 2025
  write: IOPS=22.7k, BW=88.8MiB/s (93.2MB/s)(8192MiB/92209msec); 0 zone resets
    slat (nsec): min=827, max=29312k, avg=22260.26, stdev=102504.17
    clat (usec): min=143, max=76991, avg=1383.23, stdev=4890.92
     lat (usec): min=198, max=77006, avg=1405.75, stdev=4891.93
    clat percentiles (usec):
     |  1.00th=[  239],  5.00th=[  334], 10.00th=[  404], 20.00th=[  515],
     | 30.00th=[  619], 40.00th=[  709], 50.00th=[  807], 60.00th=[  914],
     | 70.00th=[ 1057], 80.00th=[ 1237], 90.00th=[ 1565], 95.00th=[ 1893],
     | 99.00th=[17433], 99.50th=[51119], 99.90th=[64750], 99.95th=[68682],
     | 99.99th=[73925]
   bw (  KiB/s): min=58968, max=139512, per=100.00%, avg=90997.51, stdev=26262.98, samples=184
   iops        : min=14742, max=34878, avg=22749.33, stdev=6565.73, samples=184
  lat (usec)   : 250=1.33%, 500=17.54%, 750=25.16%, 1000=22.47%
  lat (msec)   : 2=29.35%, 4=2.91%, 10=0.05%, 20=0.30%, 50=0.36%
  lat (msec)   : 100=0.52%
  cpu          : usr=6.14%, sys=53.60%, ctx=217169, majf=0, minf=11
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2097152,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=88.8MiB/s (93.2MB/s), 88.8MiB/s-88.8MiB/s (93.2MB/s-93.2MB/s), io=8192MiB (8590MB), run=92209-92209msec

Disk stats (read/write):
  nvme0n1: ios=51/2095400, merge=0/0, ticks=1/2747631, in_queue=988512, util=100.00%