LearnedFTL_test3.txt
seqwrite: (g=0): rw=write, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process

seqwrite: (groupid=0, jobs=1): err= 0: pid=1241: Thu Jul 17 09:06:25 2025
  write: IOPS=32.6k, BW=127MiB/s (133MB/s)(8192MiB/64351msec); 0 zone resets
    slat (nsec): min=860, max=261379k, avg=21950.94, stdev=203214.20
    clat (usec): min=133, max=598995, avg=958.39, stdev=4132.07
     lat (usec): min=197, max=599033, avg=980.63, stdev=4149.81
    clat percentiles (usec):
     |  1.00th=[  594],  5.00th=[  668], 10.00th=[  693], 20.00th=[  693],
     | 30.00th=[  701], 40.00th=[  709], 50.00th=[  725], 60.00th=[  742],
     | 70.00th=[  766], 80.00th=[  791], 90.00th=[  832], 95.00th=[  881],
     | 99.00th=[ 1106], 99.50th=[ 2540], 99.90th=[62129], 99.95th=[62653],
     | 99.99th=[94897]
   bw (  KiB/s): min=37352, max=172416, per=99.96%, avg=130301.66, stdev=29126.11, samples=128
   iops        : min= 9338, max=43104, avg=32575.38, stdev=7281.54, samples=128
  lat (usec)   : 250=0.13%, 500=0.56%, 750=63.86%, 1000=33.83%
  lat (msec)   : 2=1.08%, 4=0.10%, 10=0.05%, 20=0.02%, 50=0.12%
  lat (msec)   : 100=0.25%, 250=0.01%, 500=0.01%, 750=0.01%
  cpu          : usr=8.82%, sys=70.86%, ctx=1782, majf=0, minf=12
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=0,2097152,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: bw=127MiB/s (133MB/s), 127MiB/s-127MiB/s (133MB/s-133MB/s), io=8192MiB (8590MB), run=64351-64351msec

Disk stats (read/write):
  nvme0n1: ios=51/2089586, merge=0/0, ticks=1/843405, in_queue=408188, util=98.94%