LearnedFTL_test4.txt
seqread: (g=0): rw=read, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=32
fio-3.16
Starting 1 process

seqread: (groupid=0, jobs=1): err= 0: pid=1167: Thu Jul 17 09:10:01 2025
  read: IOPS=40.2k, BW=157MiB/s (164MB/s)(8192MiB/52223msec)
    slat (nsec): min=840, max=123603k, avg=22692.38, stdev=155721.06
    clat (nsec): min=1213, max=1251.6M, avg=773020.11, stdev=4680293.22
     lat (usec): min=22, max=1251.7k, avg=796.01, stdev=4711.81
    clat percentiles (usec):
     |  1.00th=[  578],  5.00th=[  668], 10.00th=[  676], 20.00th=[  685],
     | 30.00th=[  693], 40.00th=[  709], 50.00th=[  717], 60.00th=[  734],
     | 70.00th=[  750], 80.00th=[  783], 90.00th=[  824], 95.00th=[  873],
     | 99.00th=[ 1057], 99.50th=[ 1188], 99.90th=[ 2900], 99.95th=[20055],
     | 99.99th=[26346]
   bw (  KiB/s): min=   18, max=174856, per=99.05%, avg=159098.56, stdev=24803.95, samples=104
   iops        : min=    4, max=43714, avg=39774.47, stdev=6201.00, samples=104
  lat (usec)   : 2=0.01%, 50=0.01%, 100=0.07%, 250=0.17%, 500=0.41%
  lat (usec)   : 750=68.33%, 1000=29.59%
  lat (msec)   : 2=1.27%, 4=0.09%, 10=0.01%, 20=0.03%, 50=0.05%
  lat (msec)   : 100=0.01%, 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01%
  lat (msec)   : 2000=0.01%
  cpu          : usr=7.36%, sys=91.67%, ctx=419, majf=0, minf=46
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=2097152,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=157MiB/s (164MB/s), 157MiB/s-157MiB/s (164MB/s-164MB/s), io=8192MiB (8590MB), run=52223-52223msec

Disk stats (read/write):
  nvme0n1: ios=2088377/0, merge=0/0, ticks=40654/0, in_queue=872, util=97.11%